//Day04
package class_Demo.Demo1;

//类的定义
//权限修饰符 class 类名{
//  成员变量(代表属性,一般是名词)    修饰符 数据类型 变量名 = 初始化值;
//  成员方法(代表行为,一般是动词)
//  构造器
//  代码块
//  内部类
//}

//权限修饰符
//private   私有  只能在本类才能访问
//public    公有  所有包中的任何类均可访问
//protected 私有  同一包内的所有类,不同包的子类（通过继承）
//默认       私有  同一包内的所有类可见,用途：包内共享实现细节，但不对外部包开放。

//使用类
//类名 变量名 = new 类名();

//描述事物的类叫做Javabean类,Javabean类中是不写main方法的
//编写main方法的类,叫做测试类,可以在测试类中创建Javabean类的对象并进行赋值调用

//一个java文件中定义多个class类,但最多一个calss类用public进行修饰,而且public修饰的类名必须成为代码文件名
//实际开发中还是建议一个文件定义一个class类

//封装:对象代表就要封装对应的数据,并提供数据对应的行为


public class ClassDemo1 {
}
